app/Models/Jogos/JaZereiModelos.php

SELECT *
FROM `jogos_ja_zerei`
WHERE `jogos_ja_zerei`.`deleted_at` IS NULL
---
    public function get_all()
    {
        try {
            $query=$this->findAll();