app/Models/Consoles/ConsolesModelos.php

    public function set_array($array_dados)
    {
        try {
            $this->insertBatch($array_dados);
---
INSERT INTO `consoles` (`nome_console`, `resumo`, `ano_lancamento`, `created_at`, `updated_at`) VALUES ('teste', 'teste', 888, '2023-01-08 17:18:57', '2023-01-08 17:18:57')